Repository: Marcin-975/VScode-ncproj
Catalog: cmtconfig/Properties/Resources.*.resx
Languages: pl

# ABOUT_FORM_LICENSE
source: - Lifetime
pl: - Bezterminowa

# ATTRIBUTES_FORM_FUNCTION
source: Function
pl: Funkcja

# ATTRIBUTES_FORM_LINE
source: Line
pl: Linia

# ATTRIBUTES_FORM_MACRO
source: Macro
pl: Makro

# AUTOUPDATER_APP_CLOSING
source: Application exiting...
pl: Zamykanie aplikacji...

# AUTOUPDATER_FAILED_CONNECTION
source: There is a problem reaching update server. Please check your internet connection and try again later.
pl: Wystąpił problem z dostępem do serwera aktualizacji. Sprawdź połączenie internetowe i spróbuj ponownie później.

# AUTOUPDATER_NEW_MANDATORY_VERSION_AVAILABLE
source: There is new version {0} available. You are using version {1}. This is required update. Press Ok to begin updating the application.
pl: Dostępna jest nowa wersja {0}. Używasz wersji {1}. Jest to wymagana aktualizacja. Naciśnij Ok, aby rozpocząć aktualizację aplikacji.

# AUTOUPDATER_NEW_VERSION_AVAILABLE
source: There is new version {0} available. You are using version {1}. Do you want to update the application now?
pl: Dostępna jest nowa wersja {0}. Używasz wersji {1}. Czy chcesz teraz zaktualizować aplikację?

# AUTOUPDATER_NO_UPDATE_AVAILABLE
source: There is no update available. Please try again later.
pl: Brak dostępnych aktualizacji.

# EDITOR_FORM_ANALYSING_FILE
source: Analyzing file
pl: Analizowanie pliku

# EDITOR_FORM_AXIS_ROTATING
source: Axis rotating...
pl: Obracanie osi...

# EDITOR_FORM_CONVERTING
source: Converting...
pl: Konwertowanie...

# EDITOR_FORM_DELETING_NUMBERING
source: Numbering deleting...
pl: Usuwanie numeracji...

# EDITOR_FORM_FILE_LOADING
source: File loading in progress, please wait...
pl: Trwa ładowanie pliku, proszę czekać...

# EDITOR_FORM_FORMATTING
source: Formatting...
pl: Formatowanie...

# EDITOR_FORM_HELP
source: Help
pl: Pomoc

# EDITOR_FORM_MODIFIED_FILE
source: is modified. Save file?
pl: jest zmodyfikowany, Zapisać plik?

# EDITOR_FORM_NEW_FILE
source: New file
pl: Nowy plik

# EDITOR_FORM_RENUMBERING
source: Renumbering....
pl: Renumerowanie...

# EDITOR_FORM_TOOLTIP_TEXT
source: Inserts the code snippet:\n
pl: Wstawia fragment kodu:\n

# ERROR_FILE_NOT_EXIST
source: File does not exist:
pl: Plik nie istnieje:

# ERROR_FORM_COLUMN
source: Column
pl: Kolumna

# ERROR_FORM_DESCRIPTION
source: Description
pl: Opis

# ERROR_FORM_LINE
source: Line
pl: Linia

# ERROR_MACHINE_NOT_SET
source: Machine Tool / Control not set!
pl: Obrabiarka / sterownik nie ustawione!

# FILE_SPLITTER_FORM_BLOCK_NUMBER
source: Blocks Number
pl: liczbę bloków

# FILE_SPLITTER_FORM_TEXT
source: Text
pl: tekst w kodzie NC

# FILE_SPLITTER_FORM_TOOL_CALL
source: Tool Call
pl: wywołanie narzędzia

# FILE_SPLITTER_FORM_TOOL_WORK_PATH
source: Tool Work Path
pl: drogę narzędzia

# FILE_SPLITTER_FORM_TOOL_WORK_TIME
source: Tool Work Time
pl: czas pracy narzędzia

# FILE_SPLITTING_FILE_WITH_ERRORS
source: A file containing errors can not be split.
pl: Nie można podzielić pliku zawierającego błędy.

# FILE_SPLITTING_MANY_FILES
source: The current file will be split into
pl: Bieżacy plik zostanie podzielony na

# FILE_SPLITTING_MANY_FILES_CONTINUE
source: files. Continue?
pl: plików. Kontynuować?

# FILE_SPLITTING_NOTHING_TO_SPLIT
source: Nothing to split.
pl: Nie ma nic do podziału.

# FIND_FORM_FILE_END
source: The end of the file. Search completed.
pl: Koniec pliku. Wyszukiwanie zakończone.

# GOTO_FORM_LINE_RANGE
source: Line range (1 - {0}):
pl: Zakres linii (1 - {0}):

# INFO_FORM_ABSOLUTE
source: absolute
pl: absolutne

# INFO_FORM_AXIS
source: Axis
pl: Oś

# INFO_FORM_COOLANT
source: Coolant
pl: Chłodziwo

# INFO_FORM_CUTTER_COMPENSATION
source: Cutter Comp.
pl: Korekcja

# INFO_FORM_FEEDRATE
source: Feedrate
pl: Posuw

# INFO_FORM_INCH
source: inch
pl: cale

# INFO_FORM_INCREMENTAL
source: incremental
pl: przyrostowe

# INFO_FORM_MACHINE_RELATIVE_POS
source: Position relative to the Machine range
pl: Pozycja względem zakresu obrabiarki

# INFO_FORM_MM
source: millimeter
pl: milimetry

# INFO_FORM_PATH_TOTAL
source: Path Total
pl: Droga Całkowita

# INFO_FORM_PROGRAMMING
source: Programming
pl: Programowanie

# INFO_FORM_PROGRAM_ZERO_RELATIVE_POS
source: Position relative to Program Zero
pl: Pozycja względem zera programu

# INFO_FORM_SPINDLE
source: Spindle
pl: Obroty

# INFO_FORM_TIME_TOTAL
source: Time Total
pl: Czas Całkowity

# INFO_FORM_TOOL_ID
source: Tool Number
pl: Nr Narzędzia

# INFO_FORM_TOOL_PATH
source: Tool Path
pl: Droga Narzędzia

# INFO_FORM_TOOL_TIME
source: Tool Time
pl: Czas Narzędzia

# INFO_FORM_UNITS
source: Units
pl: Jednostki

# INFO_FORM_VALUE
source: Value
pl: Wartość

# LIBRARY_FORM_VIEW
source: View
pl: Podgląd

# LIBRARY_FORM_VIEW_EDIT
source: View / Edit
pl: Podgląd / Edycja

# MACRO_VAR_FORM_LINE
source: Line
pl: Linia

# MACRO_VAR_FORM_PARAM
source: Parameter
pl: Parametr

# MAINFORM_ACTIVATE
source: Activate Product Code...
pl: Aktywuj kod produktu...

# MAINFORM_ANALYSIS_AUTOMATIC
source: Automatic analysis
pl: Analiza automatyczna

# MAINFORM_ANALYSIS_DISABLED
source: Analysis disabled
pl: Analiza wyłączona

# MAINFORM_DEACTIVATE
source: Deactivate Product Code
pl: Deaktywuj kod produktu

# MAINFORM_PROGRAM_CORRECT
source: NC Program Correct
pl: Program poprawny

# MAINFORM_PROGRAM_INCORRECT
source: NC Program Incorrect
pl: Program zawiera błędy

# MAINFORM_PROGRAM_UNCHECKED
source: NC Program Unchecked
pl: Program niesprawdzony

# MAINFORM_RECENTLY_OPENED_FILES
source: Recently Opened Files...
pl: Ostatnio otwarte pliki...

# MCODES_EDITOR_FORM_CODE
source: Code
pl: Kod

# MCODES_EDITOR_FORM_CODE_EXISTS_IN_GROUP
source: Code {0} already exists in group {1}
pl: Kod {0} już istnieje w grupie {1}

# MCODES_EDITOR_FORM_COPY
source: - copy
pl: - kopia

# MCODES_EDITOR_FORM_DEFAULT
source: Default
pl: Domyślny

# MCODES_EDITOR_FORM_DESCRIPTION
source: Description
pl: Opis

# MCODES_EDITOR_FORM_GROUP_EXISTS
source: Group already exists
pl: Grupa już istnieje

# MCODES_EDITOR_FORM_GROUP_NAME
source: Group Name
pl: Nazwa grupy

# MCODES_EDITOR_FORM_NO_NAME
source: No name
pl: Brak nazwy

# MCODES_EDITOR_FORM_NO_PROFILE
source: No active profile
pl: Brak aktywnego profilu

# MCODES_EDITOR_FORM_PROFILE_EXISTS
source: Profile already exists
pl: Profil już istnieje

# MCODES_EDITOR_FORM_PROFILE_NAME
source: Profile Name
pl: Nazwa profilu

# NOT_AVAILABLE_IN_LITE
source: This functionality is not available in the Lite version
pl: Funkcjonalność niedostępna w wersji Lite

# PATH_FORM_LINE_NUMBER
source: Line #
pl: Nr linii

# PATH_FORM_RAPID_POSITIONING_PATH
source: Rapid Positioning Path
pl: Długość ruchów szybkich

# PATH_FORM_RAPID_POSITIONING_TIME
source: Rapid Positioning Time
pl: Czas ruchów szybkich

# PATH_FORM_TOOL_NUMBER
source: Tool #
pl: Nr narzędzia

# PATH_FORM_TOOL_PATH
source: Tool Path
pl: Droga narzędzia

# PATH_FORM_TOOL_TIME
source: Tool Time
pl: Czas pracy narzędzia

# PATH_FORM_TOTAL_PATH
source: Total Path
pl: Droga całkowita

# PATH_FORM_TOTAL_TIME
source: Total Time
pl: Czas całkowity

# PATH_FORM_WORKING_PATH
source: Working Path
pl: Długość ruchów roboczych

# PATH_FORM_WORKING_TIME
source: Working Time
pl: Czas ruchów roboczych

# PROGRAM_SETTINGS_FORM_RESTART
source: Language change requires application restart to take effect
pl: Zmiana języka nastąpi po ponownym uruchomieniu aplikacji

# REPLACE_FORM_FILE_END
source: End of File.
pl: Koniec pliku. Wyszukiwanie zakończone.

# REPLACE_FORM_REPLACED
source: Replaced {0} occurrence(s).
pl: Zastąpiono {0} wystąpień.

# ROTATE_AXES_FORM_NO_ROTATION
source: No rotation
pl: brak obrotu

# ROTATE_AXES_FORM_X180
source: X axis, 180 degrees
pl: oś X, 180 stopni

# ROTATE_AXES_FORM_X270
source: X axis, 270 degrees
pl: oś X, 270 stopni

# ROTATE_AXES_FORM_X90
source: X axis, 90 degrees
pl: oś X, 90 stopni

# ROTATE_AXES_FORM_Y180
source: Y axis, 180 degrees
pl: oś Y, 180 stopni

# ROTATE_AXES_FORM_Y270
source: Y axis, 270 degrees
pl: oś Y, 270 stopni

# ROTATE_AXES_FORM_Y90
source: Y axis, 90 degrees
pl: oś Y, 90 stopni

# ROTATE_AXES_FORM_Z180
source: Z axis, 180 degrees
pl: oś Z, 180 stopni

# ROTATE_AXES_FORM_Z270
source: Z axis, 270 degrees
pl: oś Z, 270 stopni

# ROTATE_AXES_FORM_Z90
source: Z axis, 90 degrees
pl: oś Z, 90 stopni

# SPLASHSCREEN_APPLICATION_SETTINGS
source: Loading application settings...
pl: Wczytywanie ustawień aplikacji...

# SPLASHSCREEN_CURRENT_NC_SETTINGS
source: Loading the current NC settings...
pl: Wczytywanie bieżących ustawień NC...

# SPLASHSCREEN_DEFAULT_NC_SETTINGS
source: Loading default NC settings...
pl: Wczytywanie domyślnych ustawień NC...

# SPLASHSCREEN_DOCKABLE_WINDOWS
source: Creating dockable windows...
pl: Tworzenie dokowalnych okien...

# SPLASHSCREEN_NEW_VERSION
source: Checking the availability of a new version of the program...
pl: Sprawdzanie dostępności nowej wersji programu...

# SPLASHSCREEN_RECENT_FILES
source: Loading a list of recently opened files...
pl: Wczytywanie listy ostatnio otwieranych plików...

# SPLASHSCREEN_VERIFYING_LICENSE
source: Verifying the program license...
pl: Weryfikowanie licencji programu...

# SPLASHSCREEN_WINDOW_SETTINGS
source: Loading window settings...
pl: Wczytywanie ustawień okien...

# TA_ACTIVATE_CONTINUE_USING
source: Activate the product code to continue using the application.
pl: Aktywuj kod produktu aby móc dalej używać aplikacji.

# TA_FAILED_DEACTIVATION
source: An attempt to deactivation failed:
pl: Próba deaktywacji zakończona niepowodzeniem:

# TA_FAILED_TRIAL_END_CHECK
source: Failed to check the remaining days until the end of the trial version:
pl: Próba sprawdzenia pozostałych dni do końca wersji testowej zakończona niepowodzeniem:

# TA_FAILED_TRIAL_RUN
source: Failed to run the trial version:
pl: Próba uruchomienia wersji testowej zakończona niepowodzeniem:

# TA_FAILED_VALIDITY_ACTIVATION_CHECK
source: Failed to check the validity of the activation:
pl: Próba sprawdzenia ważności aktywacji zakończona niepowodzeniem:

# TA_TRIAL_EXPIRED
source: - The trial has expired
pl: - Wersja testowa wygasła

# TA_TRIAL_EXPIRES
source: - Your trial expires in
pl: - Wersja testowa upływa za

# TA_TRIAL_EXPIRES_DAYS
source: days
pl: dni

# UNKNOWN_ERROR_MESSAGE
source: Oops! Something went wrong. More details in:\r\n
pl: Ups! Coś poszło nie tak. Więcej szczegółów w:\r\n
