Repository: Marcin-975/VScode-ncproj
Catalog: cmtconfig/NCSettingsForm/CNCInitialParams.*.resx
Languages: pl

# labelHeader.Text
source: Machine Tool Starting Parameters
pl: Parametry startowe obrabiarki

# labelDefaultMotion.Text
source: Default movement
pl: Domyślny rodzaj ruchu

# labelDefaultWorkPlane.Text
source: Default work plane
pl: Domyślna płaszczyzna robocza

# labelDefaultDriverUnits.Text
source: Default control units
pl: Domyślne jednostki sterownika

# labelDefaultProgramming.Text
source: Default programming
pl: Domyślny rodzaj programowania

# labelDefaultFeedMode.Text
source: Default feed mode
pl: Domyślny tryb posuwu

# comboBoxDefaultMotion.Items
source: Rapid positioning
pl: Ruch szybki

# comboBoxDefaultMotion.Items1
source: Linear interpolation
pl: Interpolacja liniowa

# comboBoxDefaultDriverUnits.Items
source: Millimeter
pl: Milimetr

# comboBoxDefaultDriverUnits.Items1
source: Inch
pl: Cal

# comboBoxDefaultProgramming.Items
source: Absolute
pl: Absolutny

# comboBoxDefaultProgramming.Items1
source: Incremental
pl: Przyrostowy

# comboBoxDefaultFeedMode.Items
source: Feed per minute
pl: Posuw na minutę

# comboBoxDefaultFeedMode.Items1
source: Feed per revolution
pl: Posuw na obrót

# labelDefaultRotation.Text
source: Default rotation
pl: Domyślne obroty

# labelDefaultRotationDirection.Text
source: Default rotation direction
pl: Domyślny kierunek obrotów

# comboBoxDefaultRotationDirection.Items
source: Right
pl: Prawo

# comboBoxDefaultRotationDirection.Items1
source: Left
pl: Lewo

# labelDrillCycleZValue.Text
source: Z drilling cycle value
pl: Wartość Z w cyklu wiertarskim

# comboBoxDrillCycleZValue.Items
source: Yes
pl: Tak

# comboBoxDrillCycleZValue.Items1
source: No
pl: Nie

# labelDrillCycleReturnValue.Text
source: Return drilling cycle value
pl: Powrót w cyklu wiertarskim

# comboBoxDrillCycleReturnValue.Items
source: Yes
pl: Tak

# comboBoxDrillCycleReturnValue.Items1
source: No
pl: Nie

# checkBoxFastMotionCancelCycle.Text
source: Rapid positioning cancels cycle
pl: Ruch szybki anuluje cykle

# checkBoxLinearInterpolationCancelCycle.Text
source: Linear interpolation cancels cycle
pl: Interpolacja liniowa anuluje cykle

# checkBoxCircularInterpolationCWCancelCycle.Text
source: CW circular interpolation cancels cycle
pl: Interpolacja kołowa CW anuluje cykle

# checkBoxCircularInterpolationCCWCancelCycle.Text
source: CCW circular interpolation cancels cycle
pl: Interpolacja kołowa CCW anuluje cykle

# checkBoxCycleCancelStartsFastMotion.Text
source: Canceling the cycle enables rapid positioning
pl: Anulowanie cyklu włącza ruch szybki

# checkBoxOperatorTurnsOnRotation.Text
source: Operator turns on the rotation
pl: Obroty włącza operator

# checkBoxToolNumberExecutesExchange.Text
source: Tool number carries out a change
pl: Numer narzędzia wykonuje zmianę

# checkBoxAutoFastMotionAfterToolExchange.Text
source: Automatic rapid positioning after tool change
pl: Automatyczny ruch szybki po wymianie narzędzia
