Repository: Marcin-975/VScode-ncproj
Catalog: cmtconfig/NCSettingsForm.*.resx
Languages: pl

# buttonProgramista.Text
source: Programmer
pl: Programista

# buttonObszarRoboczy.Text
source: Machine Points
pl: Punkty Obrabiarki

# buttonParametry.Text
source: Initial Parameters
pl: Parametry Początkowe

# buttonKinematyka.Text
source: Kinematics
pl: Kinematyka

# buttonObrabiarkaCNC.Text
source: CNC Machine Tool
pl: Obrabiarka CNC

# buttonDefault.Text
source: Default
pl: Domyślne

# buttonExport.Text
source: Export
pl: Eksport

# openFileDialog1.Filter
source: NCSetting Files|*.ncsetting|All Files|*.*
pl: Pliki NCSetting|*.ncsetting|Wszystkie pliki|*.*

# saveFileDialog1.Filter
source: NCSetting Files|*.ncsetting|All Files|*.*
pl: Pliki NCSetting|*.ncsetting|Wszystkie pliki|*.*

# $this.Text
source: Control and Machine Tool configuration
pl: Konfiguracja sterownika i obrabiarki
